pmo-dataset/variations/mermaid_basic/43.mmd
graph LR
	StartEvent_1((" ")) --> Task_13["Bring Documents for Registration"]
	Task_13 --> Task_6["Check if car is still registered?"]
	Task_6 --> ExclusiveGateway_1{"Registered?"}
	ExclusiveGateway_1 -->|"no"| Task_13
	Task_11["Send reminder notification to user"] --> Task_12["Received a notificiation"]
	ExclusiveGateway_2{"Gone to service?"} -->|"yes"| Task_1["Mechanic check a car and enter problems"]
	ExclusiveGateway_3{"> 30 days?"} -->|"yes"| Task_7["User fined"]
	Task_1 --> Task_8["Receive updates while waiting"]
	Task_8 --> ExclusiveGateway_4{"Repair done?"}
	ExclusiveGateway_4 -->|"yes"| Task_2["Pay per App"]
	Task_2 --> ParallelGateway_1{"+"}
	ParallelGateway_1 --> Task_3["Save repair infos"]
	ParallelGateway_1 --> Task_9["Send 'Pickerl'"]
	Task_3 --> ParallelGateway_2{"+"}
	Task_9 --> ParallelGateway_2
	ParallelGateway_2 --> Task_4["Make appointment for next service"]
	ExclusiveGateway_2 -->|"no"| ExclusiveGateway_3
	ExclusiveGateway_4 -->|"no"| Task_8
	Task_4 --> EndEvent_1((" "))
	Task_12 --> ExclusiveGateway_2
	Task_10["Check appointment for service"] --> Task_11
	ExclusiveGateway_1 -->|"yes"| Task_10
	Task_7 --> Task_5["Make new appointment"]
	Task_5 --> Task_10
	ExclusiveGateway_3 -->|"no"| Task_11
